results/dotnet.grpc.1000.log

Summary:
  Count:	67281
  Total:	10.00 s
  Slowest:	38.07 ms
  Fastest:	1.09 ms
  Average:	7.20 ms
  Requests/sec:	6727.38

Response time histogram:
  1.087  [1]     |
  4.785  [42053] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  8.483  [9502]  |∎∎∎∎∎∎∎∎∎
  12.181 [699]   |∎
  15.879 [2464]  |∎∎
  19.577 [9644]  |∎∎∎∎∎∎∎∎∎
  23.275 [1071]  |∎
  26.973 [404]   |
  30.671 [537]   |∎
  34.369 [773]   |∎
  38.067 [83]    |

Latency distribution:
  10 % in 2.77 ms 
  25 % in 3.22 ms 
  50 % in 4.01 ms 
  75 % in 6.56 ms 
  90 % in 17.51 ms 
  95 % in 19.08 ms 
  99 % in 31.12 ms 

Status code distribution:
  [OK]            67231 responses   
  [Unavailable]   50 responses      

Error distribution:
  [8]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51414->127.0.0.1:5001: use of closed network connection   
  [8]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51419->127.0.0.1:5001: use of closed network connection   
  [8]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51418->127.0.0.1:5001: use of closed network connection   
  [9]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51416->127.0.0.1:5001: use of closed network connection   
  [9]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51417->127.0.0.1:5001: use of closed network connection   
  [8]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51415->127.0.0.1:5001: use of closed network connection