results/dotnet.grpc.10000.log

Summary:
  Count:	9956
  Total:	10.00 s
  Slowest:	139.86 ms
  Fastest:	8.50 ms
  Average:	50.06 ms
  Requests/sec:	995.55

Response time histogram:
  8.503   [1]    |
  21.639  [894]  |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  34.775  [1956] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  47.911  [2257] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  61.048  [2111] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  74.184  [1217] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  87.320  [795]  |∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  100.456 [379]  |∎∎∎∎∎∎∎
  113.592 [207]  |∎∎∎∎
  126.729 [72]   |∎
  139.865 [21]   |

Latency distribution:
  10 % in 22.86 ms 
  25 % in 32.85 ms 
  50 % in 47.07 ms 
  75 % in 63.59 ms 
  90 % in 81.60 ms 
  95 % in 94.85 ms 
  99 % in 113.43 ms 

Status code distribution:
  [OK]            9910 responses   
  [Unavailable]   46 responses     

Error distribution:
  [8]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51432->127.0.0.1:5001: use of closed network connection   
  [9]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51431->127.0.0.1:5001: use of closed network connection   
  [9]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51433->127.0.0.1:5001: use of closed network connection   
  [8]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51434->127.0.0.1:5001: use of closed network connection   
  [4]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51429->127.0.0.1:5001: use of closed network connection   
  [8]   rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51430->127.0.0.1:5001: use of closed network connection