results/dotnet.grpc.stream.1.log

Summary:
  Count:	232427
  Total:	10.00 s
  Slowest:	20.50 ms
  Fastest:	0.53 ms
  Average:	1.81 ms
  Requests/sec:	23240.69

Response time histogram:
  0.526  [1]      |
  2.523  [207063] |∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  4.520  [23157]  |∎∎∎∎
  6.517  [2058]   |
  8.514  [57]     |
  10.511 [1]      |
  12.508 [0]      |
  14.505 [0]      |
  16.503 [0]      |
  18.500 [22]     |
  20.497 [18]     |

Latency distribution:
  10 % in 1.21 ms 
  25 % in 1.39 ms 
  50 % in 1.63 ms 
  75 % in 1.99 ms 
  90 % in 2.60 ms 
  95 % in 3.35 ms 
  99 % in 4.48 ms 

Status code distribution:
  [Canceled]      40 responses       
  [Unavailable]   10 responses       
  [OK]            232377 responses   

Error distribution:
  [40]   rpc error: code = Canceled desc = grpc: the client connection is closing                                                                     
  [7]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51442->127.0.0.1:5001: use of closed network connection   
  [2]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51440->127.0.0.1:5001: use of closed network connection   
  [1]    rpc error: code = Unavailable desc = error reading from server: read tcp 127.0.0.1:51439->127.0.0.1:5001: use of closed network connection